at0m-b0mb/Dolos-ESP32-S3-GEEK/sdkconfig.defaults
# Dolos build defaults - Waveshare ESP32-S3-GEEK (ESP32-S3, 16MB flash, 2MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"

# flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 2MB quad PSRAM (framebuffer lives here)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# USB: TinyUSB in device mode, HID class only. This is what makes the board a
# keyboard. It boots SAFE and only sends reports after the operator arms it.
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_ENABLED=n

# Console stays on USB-Serial/JTAG for boot logs (until HID takes the USB pins).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# long filenames so payloads can be named readably on the SD picker
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64

# --- scheduler tick -------------------------------------------------------
# 1 kHz, NOT the 100 Hz default. At 100 Hz one tick is 10 ms, so
# pdMS_TO_TICKS(5) rounds DOWN TO ZERO and the delay silently disappears -
# which is exactly what made the "fast" and "balanced" typing profiles emit
# keystrokes back-to-back with no pacing at all, and drop characters.
CONFIG_FREERTOS_HZ=1000

# NOTE: the parse buffers live in PSRAM, but they are allocated from the PSRAM
# HEAP at run time - not by moving .bss there. Moving .bss relocates every
# static in the image, Wi-Fi's own included, and Wi-Fi needs some of its
# structures in internal DMA-capable RAM.
# CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY is not set
# A task stack in PSRAM is unusable whenever the cache is off - which is exactly
# what an NVS commit does - and the failure is a CacheError with a wild PC, not
# an allocation error. Keep every stack in internal RAM.
# CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY is not set
# Wi-Fi, TinyUSB and the SD card all need DMA-capable INTERNAL memory, and with
# PSRAM present the allocator hands out external RAM until this reserve is all
# that is left. 32 KB was not enough headroom for the radio to come up beside
# the other three; the device crashed on boot with the radio on and survived in
# safe boot, where the radio is the one thing that does not start.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Mass storage, so ATTACKMODE HID STORAGE can expose one microSD partition to
# the host. The MSC interface is always present in the descriptor; whether a
# medium exists is decided at run time (see main/usb_msc.c).
CONFIG_TINYUSB_MSC_ENABLED=y

# Timer callbacks here reach heap/PSRAM code, and 3584 was not enough:
# the core dump caught esp_timer smashing its own stack inside
# esp_psram_check_ptr_addr with a poisoned return frame.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
